OpenFOAM/4.x/ERCOFTAC-SIG15/case9.4/ahmed35/RANS/system/forceCoeffsIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates lift, drag and moment coefficients by summing forces on
    specified patches for a case where the solver is incompressible (pressure
    is kinematic, e.g. m^2/s^2).

\*---------------------------------------------------------------------------*/

patches     (AhmedGroup);

magUInf     40;
lRef        0.288;
Aref        0.115;

liftDir     (0 0 1);
dragDir     (1 0 0);

CofR        (0 0 0);
pitchAxis   (0 1 0);

#includeEtc "caseDicts/postProcessing/forces/forceCoeffs.cfg"

log         yes;

// ************************************************************************* //
